zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxDmu_reg.h
/** \brief 10510, PFLASH Bank 5 Protection Configuration 4 */
#define DMU_HP5_PROCON_P4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050510u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_P4.
* To use register names with standard convension, please use DMU_HP5_PROCON_P4.
*/
#define DMU_HP_PROCONP54 (DMU_HP5_PROCON_P4)

/** \brief 10514, PFLASH Bank 5 Protection Configuration 5 */
#define DMU_HP5_PROCON_P5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050514u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_P5.
* To use register names with standard convension, please use DMU_HP5_PROCON_P5.
*/
#define DMU_HP_PROCONP55 (DMU_HP5_PROCON_P5)

/** \brief 10540, PFLASH Bank 5 OTP Protection Configuration 0 */
#define DMU_HP5_PROCON_OTP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050540u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_OTP0.
* To use register names with standard convension, please use DMU_HP5_PROCON_OTP0.
*/
#define DMU_HP_PROCONOTP50 (DMU_HP5_PROCON_OTP0)

/** \brief 10544, PFLASH Bank 5 OTP Protection Configuration 1 */
#define DMU_HP5_PROCON_OTP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050544u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_OTP1.
* To use register names with standard convension, please use DMU_HP5_PROCON_OTP1.
*/
#define DMU_HP_PROCONOTP51 (DMU_HP5_PROCON_OTP1)

/** \brief 10548, PFLASH Bank 5 OTP Protection Configuration 2 */
#define DMU_HP5_PROCON_OTP2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050548u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_OTP2.
* To use register names with standard convension, please use DMU_HP5_PROCON_OTP2.
*/
#define DMU_HP_PROCONOTP52 (DMU_HP5_PROCON_OTP2)

/** \brief 1054C, PFLASH Bank 5 OTP Protection Configuration 3 */
#define DMU_HP5_PROCON_OTP3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805054Cu)
/** Alias (User Manual Name) for DMU_HP5_PROCON_OTP3.
* To use register names with standard convension, please use DMU_HP5_PROCON_OTP3.
*/
#define DMU_HP_PROCONOTP53 (DMU_HP5_PROCON_OTP3)

/** \brief 10550, PFLASH Bank 5 OTP Protection Configuration 4 */
#define DMU_HP5_PROCON_OTP4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050550u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_OTP4.
* To use register names with standard convension, please use DMU_HP5_PROCON_OTP4.
*/
#define DMU_HP_PROCONOTP54 (DMU_HP5_PROCON_OTP4)

/** \brief 10554, PFLASH Bank 5 OTP Protection Configuration 5 */
#define DMU_HP5_PROCON_OTP5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050554u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_OTP5.
* To use register names with standard convension, please use DMU_HP5_PROCON_OTP5.
*/
#define DMU_HP_PROCONOTP55 (DMU_HP5_PROCON_OTP5)

/** \brief 10580, PFLASH Bank 5 WOP Configuration 0 */
#define DMU_HP5_PROCON_WOP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050580u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_WOP0.
* To use register names with standard convension, please use DMU_HP5_PROCON_WOP0.
*/
#define DMU_HP_PROCONWOP50 (DMU_HP5_PROCON_WOP0)

/** \brief 10584, PFLASH Bank 5 WOP Configuration 1 */
#define DMU_HP5_PROCON_WOP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050584u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_WOP1.
* To use register names with standard convension, please use DMU_HP5_PROCON_WOP1.
*/
#define DMU_HP_PROCONWOP51 (DMU_HP5_PROCON_WOP1)

/** \brief 10588, PFLASH Bank 5 WOP Configuration 2 */
#define DMU_HP5_PROCON_WOP2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050588u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_WOP2.
* To use register names with standard convension, please use DMU_HP5_PROCON_WOP2.
*/
#define DMU_HP_PROCONWOP52 (DMU_HP5_PROCON_WOP2)

/** \brief 1058C, PFLASH Bank 5 WOP Configuration 3 */
#define DMU_HP5_PROCON_WOP3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805058Cu)
/** Alias (User Manual Name) for DMU_HP5_PROCON_WOP3.
* To use register names with standard convension, please use DMU_HP5_PROCON_WOP3.
*/
#define DMU_HP_PROCONWOP53 (DMU_HP5_PROCON_WOP3)

/** \brief 10590, PFLASH Bank 5 WOP Configuration 4 */
#define DMU_HP5_PROCON_WOP4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050590u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_WOP4.
* To use register names with standard convension, please use DMU_HP5_PROCON_WOP4.
*/
#define DMU_HP_PROCONWOP54 (DMU_HP5_PROCON_WOP4)

/** \brief 10594, PFLASH Bank 5 WOP Configuration 5 */
#define DMU_HP5_PROCON_WOP5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050594u)
/** Alias (User Manual Name) for DMU_HP5_PROCON_WOP5.
* To use register names with standard convension, please use DMU_HP5_PROCON_WOP5.
*/
#define DMU_HP_PROCONWOP55 (DMU_HP5_PROCON_WOP5)

/** \brief 105A0, PFLASH Bank 5 Erase Counter Priority configuration 0 */
#define DMU_HP5_ECPRIO_P0 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P0*)0xF80505A0u)
/** Alias (User Manual Name) for DMU_HP5_ECPRIO_P0.
* To use register names with standard convension, please use DMU_HP5_ECPRIO_P0.
*/
#define DMU_HP_ECPRIO50 (DMU_HP5_ECPRIO_P0)

/** \brief 105A4, PFLASH Bank 5 Erase Counter Priority Configuration 1 */
#define DMU_HP5_ECPRIO_P1 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P1*)0xF80505A4u)
/** Alias (User Manual Name) for DMU_HP5_ECPRIO_P1.
* To use register names with standard convension, please use DMU_HP5_ECPRIO_P1.
*/
#define DMU_HP_ECPRIO51 (DMU_HP5_ECPRIO_P1)

/** \brief 105A8, PFLASH Bank 5 Erase Counter Priority Configuration 2 */
#define DMU_HP5_ECPRIO_P2 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P2*)0xF80505A8u)
/** Alias (User Manual Name) for DMU_HP5_ECPRIO_P2.
* To use register names with standard convension, please use DMU_HP5_ECPRIO_P2.
*/
#define DMU_HP_ECPRIO52 (DMU_HP5_ECPRIO_P2)

/** \brief 105AC, PFLASH Bank 5 Erase Counter Priority Configuration 3 */
#define DMU_HP5_ECPRIO_P3 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P3*)0xF80505ACu)
/** Alias (User Manual Name) for DMU_HP5_ECPRIO_P3.
* To use register names with standard convension, please use DMU_HP5_ECPRIO_P3.
*/
#define DMU_HP_ECPRIO53 (DMU_HP5_ECPRIO_P3)

/** \brief 105B0, PFLASH Bank 5 Erase Counter Priority Configuration 4 */
#define DMU_HP5_ECPRIO_P4 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P4*)0xF80505B0u)
/** Alias (User Manual Name) for DMU_HP5_ECPRIO_P4.
* To use register names with standard convension, please use DMU_HP5_ECPRIO_P4.
*/
#define DMU_HP_ECPRIO54 (DMU_HP5_ECPRIO_P4)

/** \brief 105B4, PFLASH Bank 5 Erase Counter Priority Configuration 5 */
#define DMU_HP5_ECPRIO_P5 /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_HP_ECPRIO_P5*)0xF80505B4u)
/** Alias (User Manual Name) for DMU_HP5_ECPRIO_P5.
* To use register names with standard convension, please use DMU_HP5_ECPRIO_P5.
*/
#define DMU_HP_ECPRIO55 (DMU_HP5_ECPRIO_P5)

/** \brief 20010, HSM Flash Status Register */
#define DMU_SF_STATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_DMU_SF_STATUS*)0xF8060010u)

